
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORD.
       AUTHOR. RODRIGO OLIVEIRA.
       DATE-WRITTEN. 2026-01-12.   

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. LINUX-PC.
       OBJECT-COMPUTER. LINUX-PC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-MENSAGEM PIC X(21) VALUE "Olá, Mundo do COBOL!".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY WS-MENSAGEM.
           STOP RUN.
       
